[default reserve_graph_table]
[default required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY]
[prepare_database]
CREATE TABLE person AS
(SELECT 1 AS id, "name1" AS name) UNION ALL
(SELECT 2 AS id, "name2" AS name) UNION ALL
(SELECT 3 as id, "name3" AS name)
--
ARRAY<STRUCT<id INT64, name STRING>>[{1, "name1"}, {2, "name2"}, {3, "name3"}]
==
[prepare_database]
CREATE TABLE person_knows_person AS
(SELECT 100 AS id, 1 AS from_person_id, 1 AS to_person_id, TIMESTAMP '2000-01-01 00:00:00' AS since) UNION ALL
(SELECT 200 AS id, 1 AS from_person_id, 2 AS to_person_id, TIMESTAMP '2000-01-02 00:00:00' AS since) UNION ALL
(SELECT 300 AS id, 2 AS from_person_id, 1 AS to_person_id, TIMESTAMP '2000-01-03 00:00:00' AS since)
--
ARRAY<STRUCT<id INT64, from_person_id INT64, to_person_id INT64, since TIMESTAMP>>[
  {
    100,
    1,
    1,
    2000-01-01 08:00:00+00
  },
  {
    200,
    1,
    2,
    2000-01-02 08:00:00+00
  },
  {
    300,
    2,
    1,
    2000-01-03 08:00:00+00
  }
]
==
[prepare_database]
CREATE TABLE account AS
(SELECT 10 AS acct_id, 1 AS owner_id, "checking" AS kind
) UNION ALL
(SELECT 20 AS acct_id, 1 AS owner_id, "savings" AS kind
) UNION ALL
(SELECT 30 AS acct_id, 2 AS owner_id, "checking" AS kind
)UNION ALL
(SELECT 40 AS acct_id, 2 AS owner_id, "savings" as kind)
--
ARRAY<STRUCT<acct_id INT64, owner_id INT64, kind STRING>>[
  {10, 1, "checking"},
  {20, 1, "savings"},
  {30, 2, "checking"},
  {40, 2, "savings"}
]
==

[prepare_database]
CREATE TABLE transfer AS
(SELECT 1 AS id, 10 AS from_account_id, 20 AS to_account_id, 100 AS amount) UNION ALL
(SELECT 2 AS id, 10 AS from_account_id, 20 AS to_account_id, 200 AS amount) UNION ALL
(SELECT 3 AS id, 20 AS from_account_id, 30 AS to_account_id, 300 AS amount) UNION ALL
(SELECT 4 AS id, 20 AS from_account_id, 30 AS to_account_id, 400 AS amount) UNION ALL
(SELECT 5 AS id, 30 AS from_account_id, 10 AS to_account_id, 500 AS amount) UNION ALL
(SELECT 6 AS id, 10 AS from_account_id, 10 AS to_account_id, 600 AS amount)
--
ARRAY<STRUCT<
        id INT64,
        from_account_id INT64,
        to_account_id INT64,
        amount INT64
      >>
[{1, 10, 20, 100},
 {2, 10, 20, 200},
 {3, 20, 30, 300},
 {4, 20, 30, 400},
 {5, 30, 10, 500},
 {6, 10, 10, 600}]
==
[prepare_database]
CREATE TABLE login AS
(SELECT 1 AS person_id, 10 AS account_id, TIMESTAMP "2023-01-01 00:00:00 UTC" AS timestamp) UNION ALL
(SELECT 2 AS person_id, 30 AS account_id, TIMESTAMP "2023-01-04 00:00:00 UTC" AS timestamp)
--
ARRAY<STRUCT<person_id INT64, account_id INT64, timestamp TIMESTAMP>>[
  {
    1,
    10,
    2023-01-01 00:00:00+00
  },
  {
    2,
    30,
    2023-01-04 00:00:00+00
  }
]
==
# This edge table is "compressed". Each row represents M*N edges from M nodes
# to N nodes.
[prepare_database]
CREATE TABLE can_transfer AS
(SELECT "checking" AS src_acct_kind, "savings" AS dest_acct_kind)
--
ARRAY<STRUCT<
        src_acct_kind STRING,
        dest_acct_kind STRING
      >>[{"checking", "savings"}]
==
[prepare_database]
CREATE PROPERTY GRAPH aml
  NODE TABLES (
    Account KEY(acct_id)
    DEFAULT LABEL PROPERTIES(
      1000 + acct_id AS account_id,
      owner_id,
      kind AS account_kind)
    LABEL HasId PROPERTIES (acct_id AS key_id),
    Person KEY(id)
    LABEL Human PROPERTIES(
      100 AS id,
      name)
    LABEL HasId PROPERTIES (id as key_id))
  EDGE TABLES (
    person_knows_person AS Knows KEY(id)
              SOURCE KEY(from_person_id) REFERENCES Person(id)
              DESTINATION KEY(to_person_id) REFERENCES Person(id)
              DEFAULT LABEL PROPERTIES(since),
    Transfer KEY(id, from_account_id, to_account_id)
              SOURCE KEY(from_account_id) REFERENCES Account(acct_id)
              DESTINATION KEY(to_account_id) REFERENCES Account(acct_id)
              DEFAULT LABEL PROPERTIES(amount),
    Login KEY(person_id, account_id, timestamp)
          SOURCE KEY(person_id) REFERENCES Person(id)
          DESTINATION KEY(account_id) REFERENCES Account(acct_id)
          DEFAULT LABEL PROPERTIES(timestamp),
    can_transfer AS CanTransfer KEY(src_acct_kind, dest_acct_kind)
                  SOURCE KEY(src_acct_kind) REFERENCES Account(kind)
                  DESTINATION KEY(dest_acct_kind) REFERENCES Account(kind)
                  LABEL can_transfer
  )
==
[name=single_match_with_return_operation]
select * from graph_table(aml
  MATCH (a IS Account Where a.account_id = 1010) (-[t1 IS Transfer]-> (b) -[t2 IS Transfer]-> WHERE t1.amount*2 > t2.amount) (c),
        (c) -[t3 IS Transfer]-> (a)
  WHERE t1.amount + t2.amount = t3.amount
  return a.account_id as aid, t1.amount as amount1, b.account_id as bid, t2.amount as amount2, c.account_id as cid, t3.amount as amount3, a.account_id as aid2
)
ORDER BY 1,3,5,7,2,4,6
--
ARRAY<STRUCT<aid INT64,
             amount1 INT64,
             bid INT64,
             amount2 INT64,
             cid INT64,
             amount3 INT64,
             aid2 INT64>>[{1010, 200, 1020, 300, 1030, 500, 1010}]
==
[name=optional_match]
select * from graph_table(aml
  MATCH (a IS Account Where a.account_id = 1010)
  OPTIONAL MATCH (a)-[t1 IS Transfer]->(b)
  return a.account_id as aid, b.account_id as bid, t1.amount
)
ORDER BY 1,2,3
--
ARRAY<STRUCT<aid INT64, bid INT64, amount INT64>>[known order:
  {1010, 1010, 600},
  {1010, 1020, 100},
  {1010, 1020, 200}
]
==
[name=optional_match2]
select * from graph_table(aml
  MATCH (p:Human)
  OPTIONAL MATCH (p)-[e IS Login]->(a:Account)
  return p.name, a.account_id as aid
)
ORDER BY 1,2
--
ARRAY<STRUCT<name STRING, aid INT64>>[known order:
  {"name1", 1010},
  {"name2", 1030},
  {"name3", NULL}
]
==
[name=optional_match3]
select * from graph_table(aml
  MATCH (a:Account)
  OPTIONAL MATCH (a)-[t IS TRANSFER]->(b)
  return a.account_id as aid, b.account_id as bid, t.amount as amount
)
ORDER BY 1,2,3
--
ARRAY<STRUCT<aid INT64, bid INT64, amount INT64>>[known order:
  {1010, 1010, 600},
  {1010, 1020, 100},
  {1010, 1020, 200},
  {1020, 1030, 300},
  {1020, 1030, 400},
  {1030, 1010, 500},
  {1040, NULL, NULL}
]
==
[name=optional_match4]
select * from graph_table(aml
  MATCH (a:Account)
  OPTIONAL MATCH (a)-[t IS TRANSFER]->(b)
  OPTIONAL MATCH (b)-[t2 IS TRANSFER]->(c)
  return a.account_id as aid, b.account_id as bid, c.account_id as cid, t.amount as first_amount, t2.amount as second_amount
)
ORDER BY 1,2,3,4,5
--
ARRAY<STRUCT<aid INT64,
             bid INT64,
             cid INT64,
             first_amount INT64,
             second_amount INT64>>
[known order:
  {1010, 1010, 1010, 600, 600},
  {1010, 1010, 1020, 600, 100},
  {1010, 1010, 1020, 600, 200},
  {1010, 1020, 1030, 100, 300},
  {1010, 1020, 1030, 100, 400},
  {1010, 1020, 1030, 200, 300},
  {1010, 1020, 1030, 200, 400},
  {1020, 1030, 1010, 300, 500},
  {1020, 1030, 1010, 400, 500},
  {1030, 1010, 1010, 500, 600},
  {1030, 1010, 1020, 500, 100},
  {1030, 1010, 1020, 500, 200},
  {1040, NULL, NULL, NULL, NULL}
]
==
[name=optional_match_multiply_declared_variables]
select * from graph_table(aml
  MATCH (a:HasId)
  OPTIONAL MATCH (id:HasId)-(a)-(id:Human)
  return a.key_id, id.name
)
ORDER BY 1,2
--
ARRAY<STRUCT<key_id INT64, name STRING>>[known order:
  {1, "name1"},
  {1, "name2"},
  {1, "name2"},
  {1, "name2"},
  {1, "name2"},
  {2, "name1"},
  {2, "name1"},
  {2, "name1"},
  {2, "name1"},
  {3, NULL},
  {10, "name1"},
  {20, NULL},
  {30, "name2"},
  {40, NULL}
]

==
[name=optional_match_multiply_declared_variables2]
select * from graph_table(aml
  MATCH (a:HasId)
  OPTIONAL MATCH (id:HasId)->(a), (b)->(id:Human)
  return a.key_id, id.name
)
ORDER BY 1,2
--
ARRAY<STRUCT<key_id INT64, name STRING>>[known order:
  {1, "name1"},
  {1, "name1"},
  {1, "name2"},
  {2, "name1"},
  {2, "name1"},
  {3, NULL},
  {10, "name1"},
  {10, "name1"},
  {20, NULL},
  {30, "name2"},
  {40, NULL}
]

==
[name=linear_queries_without_consecutive_match]
select * from graph_table(aml
  MATCH (a) (<-[k IS Knows]- WHERE true)
  RETURN a, k
  NEXT
  MATCH ((b) <-[k IS Knows]- (a)), (b) <-[IS Knows]- (b)
  RETURN a.name as person_name, k.since, b.name as friend_name
)
order by 1, 2, 3
--
ARRAY<STRUCT<person_name STRING, since TIMESTAMP, friend_name STRING>>[
  {
    "name1",
    2000-01-01 08:00:00+00,
    "name1"
  }
]
==
[name=consecutive_match_across_linear_queries]
select * from graph_table(aml
  MATCH (a IS Account Where a.account_id = 1010)
  MATCH (a) (-[t1 IS Transfer]-> (b) -[t2 IS Transfer]-> WHERE t1.amount*2 > t2.amount) (c)
  RETURN *
  NEXT
  MATCH (a) -[t1 IS Transfer]-> (b), (b) (-[t2 IS Transfer]->) (c) WHERE t1.amount*2 > t2.amount
  RETURN a, b, c, t1, t2
  NEXT
  MATCH (c) -[t3 IS Transfer]-> (a) WHERE t1.amount + t2.amount = t3.amount
  return a.account_id as aid, t1.amount as amount1, b.account_id as bid, t2.amount as amount2, c.account_id as cid, t3.amount as amount3, a.account_id as aid2
  NEXT
  RETURN *
)
ORDER BY 1,3,5,7,2,4,6
--
ARRAY<STRUCT<aid INT64,
             amount1 INT64,
             bid INT64,
             amount2 INT64,
             cid INT64,
             amount3 INT64,
             aid2 INT64>>[{1010, 200, 1020, 300, 1030, 500, 1010}]
==
# same as above, replacing RETURN ... NEXT ... by WITH
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,SQL_GRAPH_RETURN_EXTENSIONS]
[name=consecutive_match_across_linear_queries_using_with]
select * from graph_table(aml
  MATCH (a IS Account Where a.account_id = 1010)
  MATCH (a) (-[t1 IS Transfer]-> (b) -[t2 IS Transfer]-> WHERE t1.amount*2 > t2.amount) (c)
  WITH *
  MATCH (a) -[t1 IS Transfer]-> (b), (b) (-[t2 IS Transfer]->) (c) WHERE t1.amount*2 > t2.amount
  WITH a, b, c, t1, t2
  MATCH (c) -[t3 IS Transfer]-> (a) WHERE t1.amount + t2.amount = t3.amount
  WITH a.account_id as aid, t1.amount as amount1, b.account_id as bid, t2.amount as amount2, c.account_id as cid, t3.amount as amount3, a.account_id as aid2
  RETURN *
)
ORDER BY 1,3,5,7,2,4,6
--
ARRAY<STRUCT<aid INT64,
             amount1 INT64,
             bid INT64,
             amount2 INT64,
             cid INT64,
             amount3 INT64,
             aid2 INT64>>[{1010, 200, 1020, 300, 1030, 500, 1010}]
==
[name=consecutive_match_within_linear_query]
select * from graph_table(aml
  MATCH (a) -[t1 IS Transfer]-> (b)
  MATCH ((b) (-[t2 IS Transfer]-) (c)) Where a.account_id = c.account_id
  MATCH (c IS Account) -[t3 IS Transfer]-> (a)
  RETURN *
  NEXT
  RETURN a.account_id as aid, t1.amount as amount1, b.account_id as bid, t2.amount as amount2, c.account_id as cid, t3.amount as amount3, a.account_id as aid2
)
ORDER BY 1,3,5,7,2,4,6
--
ARRAY<STRUCT<aid INT64,
             amount1 INT64,
             bid INT64,
             amount2 INT64,
             cid INT64,
             amount3 INT64,
             aid2 INT64>>
[known order:
  {1010, 600, 1010, 600, 1010, 600, 1010},
  {1010, 100, 1020, 100, 1010, 600, 1010},
  {1010, 100, 1020, 200, 1010, 600, 1010},
  {1010, 200, 1020, 100, 1010, 600, 1010},
  {1010, 200, 1020, 200, 1010, 600, 1010}
]
==
[name=casting_graph_element_keeping_all_results]
select * from graph_table(aml
  MATCH (a IS Account)
  MATCH (a)
  RETURN a.name
)
order by 1
--
ARRAY<STRUCT<name STRING>>[known order:{NULL}, {NULL}, {NULL}, {NULL}]
==
[name=casting_graph_element_empty_result]
select * from graph_table(aml
  MATCH (a IS Account)
  MATCH (a IS Human)
  RETURN a.name
)
--
ARRAY<STRUCT<name STRING>>[]
==
[name=nested_linear_query]
select * from graph_table(aml
  MATCH (a) -[t1 IS Transfer]-> (b)
  MATCH ((b) (-[t2 IS Transfer]-) (c)) Where a.account_id = c.account_id AND EXISTS(
                                                                                select account_id from graph_table (
                                                                                  aml MATCH (x) WHERE SAME(x, a)
                                                                                  RETURN x.account_id
                                                                                ) limit 1
                                                                             )
  MATCH (c IS Account) -[t3 IS Transfer]-> (a)
  RETURN *
  NEXT
  RETURN a.account_id as aid, t1.amount as amount1, b.account_id as bid, t2.amount as amount2, c.account_id as cid, t3.amount as amount3, a.account_id as aid2, (
      select amount from graph_table (
        aml MATCH -[e]-> WHERE SAME(e, t1)
        RETURN e.amount
      ) limit 1
    ) AS sth
)
ORDER BY 1,3,5,7,2,4,6,8
--
ARRAY<STRUCT<aid INT64,
             amount1 INT64,
             bid INT64,
             amount2 INT64,
             cid INT64,
             amount3 INT64,
             aid2 INT64,
             sth INT64>>
[known order:
  {1010, 600, 1010, 600, 1010, 600, 1010, 600},
  {1010, 100, 1020, 100, 1010, 600, 1010, 100},
  {1010, 100, 1020, 200, 1010, 600, 1010, 100},
  {1010, 200, 1020, 100, 1010, 600, 1010, 200},
  {1010, 200, 1020, 200, 1010, 600, 1010, 200}
]

==
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,SQL_GRAPH_EXPOSE_GRAPH_ELEMENT]
[name=optional_columns_return_graph_element]
select a.account_id as aid, t1.amount as amount1, b.account_id as bid, t2.amount as amount2, c.account_id as cid, t3.amount as amount3, a.account_id as aid2 from graph_table(aml
  MATCH (a IS Account Where a.account_id = 1010) (-[t1 IS Transfer]-> (b) -[t2 IS Transfer]-> WHERE t1.amount*2 > t2.amount) (c),
        (c) -[t3 IS Transfer]-> (a)
  WHERE t1.amount + t2.amount = t3.amount
  return a, b, c, t1, t2, t3
)
ORDER BY 1,3,5,7,2,4,6
--
ARRAY<STRUCT<aid INT64,
             amount1 INT64,
             bid INT64,
             amount2 INT64,
             cid INT64,
             amount3 INT64,
             aid2 INT64>>[{1010, 200, 1020, 300, 1030, 500, 1010}]

==
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY]
[name=property_specification]
SELECT * FROM GRAPH_TABLE(aml
  MATCH (a IS Account {account_id: 1010}) -[t1 IS Transfer {amount: 600}]-> (b IS Account)
  WHERE t1.amount > 100
  RETURN a.owner_id AS sender_id, a.account_kind, t1.amount, b.owner_id AS receiver_id
)
order by 1,2,3,4
--
ARRAY<STRUCT<sender_id INT64, account_kind STRING, amount INT64, receiver_id INT64>>[
  {1, "checking", 600, 1}
]

==
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,GROUP_BY_ALL]
[name=aggregation1]
select gt.* from
graph_table(aml
  MATCH (a1:Account)-[t1:Transfer]->(a2:Account)
  RETURN a1.account_id as a1_id, a2.account_id as a2_id, COUNT(*) as count
    GROUP BY ALL
) gt
ORDER BY a1_id, a2_id, count
--
ARRAY<STRUCT<a1_id INT64, a2_id INT64, count INT64>>[known order:
  {1010, 1010, 1},
  {1010, 1020, 2},
  {1020, 1030, 2},
  {1030, 1010, 1}
]
==
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,SQL_GRAPH_RETURN_EXTENSIONS]
[name=aggregation_with1]
select gt.* from
graph_table(aml
  MATCH (a1:Account)-[t1:Transfer]->(a2:Account)
  WITH a1.account_id as a1_id, a2.account_id as a2_id, COUNT(*) as count
  RETURN *
) gt
ORDER BY a1_id, a2_id, count
--
ARRAY<STRUCT<a1_id INT64, a2_id INT64, count INT64>>[known order:
  {1010, 1010, 1},
  {1010, 1020, 2},
  {1020, 1030, 2},
  {1030, 1010, 1}
]

==
[name=aggregation2]
select gt.* from
graph_table(aml
  MATCH (a1:Account)-[t1:Transfer]->(a2:Account)
  RETURN SUM(t1.amount) as total_amount
) gt
order by 1
--
ARRAY<STRUCT<total_amount INT64>>[{2100}]

==
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,SQL_GRAPH_RETURN_EXTENSIONS]
[name=aggregation_with2]
select gt.* from
graph_table(aml
  MATCH (a1:Account)-[t1:Transfer]->(a2:Account)
  WITH SUM(t1.amount) as total_amount
  RETURN *
) gt
order by 1
--
ARRAY<STRUCT<total_amount INT64>>[{2100}]

==
[name=aggregation3]
select gt.* from
graph_table(aml
  MATCH (a1:Account)-[t1:Transfer]->(a2:Account)
  RETURN DISTINCT a1.account_id as a1_id, a2.account_id as a2_id, t1.amount as amount
) gt
ORDER BY a1_id, a2_id, amount
--
ARRAY<STRUCT<a1_id INT64, a2_id INT64, amount INT64>>[known order:
  {1010, 1010, 600},
  {1010, 1020, 100},
  {1010, 1020, 200},
  {1020, 1030, 300},
  {1020, 1030, 400},
  {1030, 1010, 500}
]
==
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,SQL_GRAPH_RETURN_EXTENSIONS]
[name=aggregation_with3]
select gt.* from
graph_table(aml
  MATCH (a1:Account)-[t1:Transfer]->(a2:Account)
  WITH DISTINCT a1.account_id as a1_id, a2.account_id as a2_id, t1.amount as amount
  RETURN *
) gt
ORDER BY a1_id, a2_id, amount
--
ARRAY<STRUCT<a1_id INT64, a2_id INT64, amount INT64>>[known order:
  {1010, 1010, 600},
  {1010, 1020, 100},
  {1010, 1020, 200},
  {1020, 1030, 300},
  {1020, 1030, 400},
  {1030, 1010, 500}
]

==
[name=aggregation4]
select gt.* from
graph_table(aml
  MATCH (a1:Account)-[t1:Transfer]->(a2:Account)
  RETURN ALL a1.account_id as a1_id, a2.account_id as a2_id
    GROUP BY a1, a2
) gt
ORDER BY a1_id, a2_id
--
ARRAY<STRUCT<a1_id INT64, a2_id INT64>>[known order:
  {1010, 1010},
  {1010, 1020},
  {1020, 1030},
  {1030, 1010}
]

==
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,SQL_GRAPH_RETURN_EXTENSIONS]
[name=aggregation_with4]
select gt.* from
graph_table(aml
  MATCH (a1:Account)-[t1:Transfer]->(a2:Account)
  WITH ALL a1.account_id as a1_id, a2.account_id as a2_id
    GROUP BY a1, a2
  RETURN *
) gt
ORDER BY a1_id, a2_id
--
ARRAY<STRUCT<a1_id INT64, a2_id INT64>>[known order:
  {1010, 1010},
  {1010, 1020},
  {1020, 1030},
  {1030, 1010}
]

==
[name=aggregation5]
select gt.* from
graph_table(aml
  MATCH (a1:Account)-[t1:Transfer]->(a2:Account)
  RETURN a1.account_id as a1_id, a2.account_id as a2_id, SUM(t1.amount) as total_amount
    GROUP BY a1_id, a2_id
) gt
ORDER BY a1_id, a2_id, total_amount
--
ARRAY<STRUCT<a1_id INT64, a2_id INT64, total_amount INT64>>[known order:
  {1010, 1010, 600},
  {1010, 1020, 300},
  {1020, 1030, 700},
  {1030, 1010, 500}
]

==
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,SQL_GRAPH_RETURN_EXTENSIONS]
[name=aggregation_with5]
select gt.* from
graph_table(aml
  MATCH (a1:Account)-[t1:Transfer]->(a2:Account)
  WITH a1.account_id as a1_id, a2.account_id as a2_id, SUM(t1.amount) as total_amount
    GROUP BY a1_id, a2_id
  RETURN *
) gt
ORDER BY a1_id, a2_id, total_amount
--
ARRAY<STRUCT<a1_id INT64, a2_id INT64, total_amount INT64>>[known order:
  {1010, 1010, 600},
  {1010, 1020, 300},
  {1020, 1030, 700},
  {1030, 1010, 500}
]

==
[name=aggregation6]
select gt.* from
graph_table(aml
  MATCH (a1:Account)-[t1:Transfer]->(a2:Account)
  RETURN DISTINCT ARRAY_AGG(a1.account_id)[OFFSET(0)] as first_id
    GROUP BY a1, t1, a2
) gt
ORDER BY first_id
--
ARRAY<STRUCT<first_id INT64>>[known order:{1010}, {1020}, {1030}]

==
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,SQL_GRAPH_RETURN_EXTENSIONS]
[name=aggregation_with6]
select gt.* from
graph_table(aml
  MATCH (a1:Account)-[t1:Transfer]->(a2:Account)
  WITH DISTINCT ARRAY_AGG(a1.account_id)[OFFSET(0)] as first_id
    GROUP BY a1, t1, a2
  RETURN *
) gt
ORDER BY first_id
--
ARRAY<STRUCT<first_id INT64>>[known order:{1010}, {1020}, {1030}]

==
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,HAVING_IN_AGGREGATE]
[name=aggregation7]
select gt.* from
graph_table(aml
  MATCH (a1:Account)-[t1:Transfer]->(a2:Account)
  LET x = t1.amount
  RETURN DISTINCT a1.account_id as a1_id, a2.account_id as a2_id, SUM(t1.amount HAVING MIN x)+MAX(x+10)-10 as norm_amount
    GROUP BY a1_id, a2_id
) gt
ORDER BY a1_id, a2_id, norm_amount
--
ARRAY<STRUCT<a1_id INT64, a2_id INT64, norm_amount INT64>>[known order:
  {1010, 1010, 1200},
  {1010, 1020, 300},
  {1020, 1030, 700},
  {1030, 1010, 1000}
]

==
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,HAVING_IN_AGGREGATE,SQL_GRAPH_RETURN_EXTENSIONS]
[name=aggregation_with7]
select gt.* from
graph_table(aml
  MATCH (a1:Account)-[t1:Transfer]->(a2:Account)
  LET x = t1.amount
  WITH DISTINCT a1.account_id as a1_id, a2.account_id as a2_id, SUM(t1.amount HAVING MIN x)+MAX(x+10)-10 as norm_amount
    GROUP BY a1_id, a2_id
  RETURN *
) gt
ORDER BY a1_id, a2_id, norm_amount
--
ARRAY<STRUCT<a1_id INT64, a2_id INT64, norm_amount INT64>>[known order:
  {1010, 1010, 1200},
  {1010, 1020, 300},
  {1020, 1030, 700},
  {1030, 1010, 1000}
]

==
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,GROUP_BY_ALL]
[name=aggregation8]
select gt.* from
graph_table(aml
  MATCH (a1:Account)-[t1:Transfer]->(a2)
  MATCH (a2:Account)-[t2:Transfer]->(a3)
  FILTER a1 != a2
  RETURN DISTINCT a1.account_id as a1_id, a2.account_id as a2_id, a3.account_id as a3_id, t1.amount as t1_amount, t2.amount as t2_amount
    GROUP BY ALL
  NEXT
  RETURN *
  NEXT
  RETURN ALL a1_id, a2_id, ARRAY_AGG(t1_amount) as arr
    GROUP BY a1_id,a2_id
) gt
ORDER BY a1_id, a2_id
--
ARRAY<STRUCT<a1_id INT64, a2_id INT64, arr ARRAY<>>>[known order:
  {
    1010,
    1020,
    ARRAY<INT64>[unknown order:200, 200, 100, 100]
  },
  {
    1020,
    1030,
    ARRAY<INT64>[unknown order:400, 300]
  },
  {
    1030,
    1010,
    ARRAY<INT64>[unknown order:500, 500, 500]
  }
]
==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY]
[name=for_operator_null_array]
select *
from graph_table(aml
  MATCH (a:Account)
  FOR element in CAST(NULL AS ARRAY<INT64>) WITH OFFSET AS offset
  RETURN a.account_id, element, offset
)
ORDER BY 1, 2, 3
--
ARRAY<STRUCT<account_id INT64, element INT64, offset INT64>>[]
==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY]
[name=for_operator_empty_untyped_array]
select *
from graph_table(aml
  MATCH (a:Account)
  FOR element in [] WITH OFFSET AS offset
  RETURN a.account_id, element, offset
)
ORDER BY 1, 2, 3
--
ARRAY<STRUCT<account_id INT64, element INT64, offset INT64>>[]
==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY]
[name=for_operator_str_literal_array]
select *
from graph_table(aml
  MATCH (a:Account)
  FOR element in ["first", "second", "third"] WITH OFFSET AS offset
  RETURN a.account_id, element, offset
)
ORDER BY 1, 2, 3
--
ARRAY<STRUCT<account_id INT64, element STRING, offset INT64>>[known order:
  {1010, "first", 0},
  {1010, "second", 1},
  {1010, "third", 2},
  {1020, "first", 0},
  {1020, "second", 1},
  {1020, "third", 2},
  {1030, "first", 0},
  {1030, "second", 1},
  {1030, "third", 2},
  {1040, "first", 0},
  {1040, "second", 1},
  {1040, "third", 2}
]
==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY]
[name=for_operator_str_literal_array_with_nulls]
select *
from graph_table(aml
  MATCH (a:Account)
  FOR element in ["a", NULL, "b", "c", NULL] WITH OFFSET AS offset
  RETURN a.account_id, element, offset
)
ORDER BY 1, 2, 3
--
ARRAY<STRUCT<account_id INT64, element STRING, offset INT64>>[known order:
  {1010, NULL, 1},
  {1010, NULL, 4},
  {1010, "a", 0},
  {1010, "b", 2},
  {1010, "c", 3},
  {1020, NULL, 1},
  {1020, NULL, 4},
  {1020, "a", 0},
  {1020, "b", 2},
  {1020, "c", 3},
  {1030, NULL, 1},
  {1030, NULL, 4},
  {1030, "a", 0},
  {1030, "b", 2},
  {1030, "c", 3},
  {1040, NULL, 1},
  {1040, NULL, 4},
  {1040, "a", 0},
  {1040, "b", 2},
  {1040, "c", 3}
]
==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,ANNOTATION_FRAMEWORK,COLLATION_SUPPORT]
[name=for_operator_str_literal_array_with_collation]
select *, element = "abc" AS is_equivalent_to_abc
from graph_table(aml
  MATCH (a:Account)
  FOR element in [COLLATE("abc", "und:ci"), COLLATE("Abc", "und:ci"), COLLATE("ABC", "und:ci")] WITH OFFSET AS offset
  RETURN a.account_id, element, offset
)
ORDER BY 1, 2, 3
--
ARRAY<STRUCT<
        account_id INT64,
        element STRING,
        offset INT64,
        is_equivalent_to_abc BOOL
      >>
[known order:
  {1010, "abc", 0, true},
  {1010, "Abc", 1, true},
  {1010, "ABC", 2, true},
  {1020, "abc", 0, true},
  {1020, "Abc", 1, true},
  {1020, "ABC", 2, true},
  {1030, "abc", 0, true},
  {1030, "Abc", 1, true},
  {1030, "ABC", 2, true},
  {1040, "abc", 0, true},
  {1040, "Abc", 1, true},
  {1040, "ABC", 2, true}
]
==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY]
[name=for_operator_gql_array_subquery]
select *
from graph_table(aml
  MATCH (a:Account)
  FOR element in ARRAY {graph aml MATCH (n:Account) RETURN COUNT(n.account_id) as col} WITH OFFSET
  RETURN a.account_id, element, offset
)
ORDER BY 1, 2, 3
--
ARRAY<STRUCT<account_id INT64, element INT64, offset INT64>>[known order:
  {1010, 4, 0},
  {1020, 4, 0},
  {1030, 4, 0},
  {1040, 4, 0}
]
==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,INLINE_LAMBDA_ARGUMENT]
[name=for_operator_array_expr]
select *
from graph_table(aml
  MATCH (a:Account)
  FOR element in ARRAY_TRANSFORM(ARRAY[1,2,3,4], e -> e + 1) WITH OFFSET
  RETURN element, offset
)
ORDER BY 1, 2
--
ARRAY<STRUCT<element INT64, offset INT64>>[known order:
  {2, 0},
  {2, 0},
  {2, 0},
  {2, 0},
  {3, 1},
  {3, 1},
  {3, 1},
  {3, 1},
  {4, 2},
  {4, 2},
  {4, 2},
  {4, 2},
  {5, 3},
  {5, 3},
  {5, 3},
  {5, 3}
]
==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,SQL_GRAPH_BOUNDED_PATH_QUANTIFICATION]
[name=for_operator_group_variable]
select COUNT(*) as cnt
from graph_table(aml
  MATCH ((a)-[b:Transfer]->(c)){1, 3}
  FOR element in b WITH OFFSET
  LET path_sum = SUM(b.amount)
  RETURN path_sum, offset
)
--
ARRAY<STRUCT<cnt INT64>>[{102}]
==
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,SQL_GRAPH_RETURN_EXTENSIONS]
[name=aggregation_with8]
select gt.* from
graph_table(aml
  MATCH (a1:Account)-[t1:Transfer]->(a2)
  MATCH (a2:Account)-[t2:Transfer]->(a3)
  FILTER a1 != a2
  WITH DISTINCT a1.account_id as a1_id, a2.account_id as a2_id, a3.account_id as a3_id, t1.amount as t1_amount, t2.amount as t2_amount
  WITH *, 1 as unused_col
  RETURN ALL a1_id, a2_id, ARRAY_AGG(t1_amount) as arr
    GROUP BY a1_id,a2_id
) gt
ORDER BY a1_id, a2_id
--
ARRAY<STRUCT<a1_id INT64, a2_id INT64, arr ARRAY<>>>[known order:
  {
    1010,
    1020,
    ARRAY<INT64>[unknown order:200, 200, 100, 100]
  },
  {
    1020,
    1030,
    ARRAY<INT64>[unknown order:400, 300]
  },
  {
    1030,
    1010,
    ARRAY<INT64>[unknown order:500, 500, 500]
  }
]

==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY]
[name=horizontal_aggregation_simple]

select * from graph_table(aml
  let single = 3
  let x = [4, 5]
  let x2 = [5, 6]
  # single is multiplying each element in x: (4*3 + 5*3) + (5 + 6)
  let r = SUM(x * single) + SUM(x2)
  return r
)
--
ARRAY<STRUCT<r INT64>>[{38}]

==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,ORDER_BY_IN_AGGREGATE]
[name=horizontal_aggregation_array_agg]

select * from graph_table(aml
  let single = 3
  let x = [4, 5]
  let r = ARRAY_CONCAT(ARRAY_AGG(x + single),
                       ARRAY_AGG(x + x ORDER BY x + single DESC),
                       ARRAY_AGG(x ORDER BY single, x),
                       ARRAY_AGG(x ORDER BY single, single, single, x),
                       ARRAY_AGG(x ORDER BY x + single, x + single, single, x))
  return r
)
--
ARRAY<STRUCT<r ARRAY<>>>[
  {ARRAY<INT64>[known order:7, 8, 10, 8, 4, 5, 4, 5, 4, 5]}
]

==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,ORDER_BY_IN_AGGREGATE,NULL_HANDLING_MODIFIER_IN_AGGREGATE,NULLS_FIRST_LAST_IN_ORDER_BY]
[name=horizontal_aggregation_array_agg_with_nulls]

select * from graph_table(aml
  let single = 3
  let x = [4, null, 5]
  let r = ARRAY_CONCAT(ARRAY_AGG(x IGNORE NULLS ORDER BY x),
    ARRAY_AGG(2 * x RESPECT NULLS ORDER BY x DESC NULLS LAST),
    ARRAY_AGG(2 * x RESPECT NULLS ORDER BY x DESC NULLS FIRST)
    )
  return r
)
--
ARRAY<STRUCT<r ARRAY<>>>[
  {ARRAY<INT64>[known order:4, 5, 10, 8, NULL, NULL, 10, 8]}
]

==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,HAVING_IN_AGGREGATE]
[name=horizontal_aggregation_having_max]

select * from graph_table(aml
  let fruit = [STRUCT("banana" as name, 100 as price),
               STRUCT("apple" as name, 20 as price),
               STRUCT("orange" as name, 200 as price)]
  let r = ANY_VALUE(fruit.name HAVING MAX fruit.price)
  return r
)
--
ARRAY<STRUCT<r STRING>>[{"orange"}]

==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,ORDER_BY_IN_AGGREGATE]
[name=horizontal_aggregation_string_agg_with_constant_arg]

select * from graph_table(aml
  let strings = ["hello", "world"]
  let r = STRING_AGG(strings, ", ")
  return r
)
--
ARRAY<STRUCT<r STRING>>[{"hello, world"}]

==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,ORDER_BY_IN_AGGREGATE]
[name=horizontal_aggregation_params]
[parameters=", " as separator, ARRAY<STRING>["hello", "world"] as arr]

select * from graph_table(aml
  let strings = @arr
  let r = STRING_AGG(strings, @separator)
  return r
)
--
ARRAY<STRUCT<r STRING>>[{"hello, world"}]

==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,ORDER_BY_IN_AGGREGATE]
[name=horizontal_aggregation_empty_array]

select * from graph_table(aml
  let x = []
  let r = COUNT(x) + ARRAY_LENGTH(x)
  let r2 = ARRAY_AGG(x)
  return r, r2
)
--
ARRAY<STRUCT<r INT64, r2 ARRAY<>>>[{0, ARRAY<INT64>(NULL)}]

==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,WITH_EXPRESSION]
[name=horizontal_aggregation_with_expr]

select * from graph_table(aml
  let x = [1,2,3]
  let x2 = [4,5,6]
  let r1 = WITH(a as SUM(x), 2 * a + COUNT(x2))
  let r2 = WITH(a as 1, a + SUM(x) + SUM(x2))
  let r3 = WITH(a as x, a[OFFSET(0)] + SUM(x) + SUM(x2))
  return r1, r2, r3
)
--
ARRAY<STRUCT<r1 INT64, r2 INT64, r3 INT64>>[{15, 22, 22}]

==


[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY]
[name=horizontal_aggregation_separate_aggregations]

# Separate horizontal aggregations are separate
SELECT * from graph_table(aml
  let x = [4, 5]
  let y = [6, 7]
  let z = SUM(x + x) + MIN(y) + MAX(x - x)
  return z
)

--
ARRAY<STRUCT<z INT64>>[{24}]

==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY]
[name=horizontal_aggregation_overflow]

# Aggregates that overflow
SELECT * from graph_table(aml
  let x = [3689348814741910528,3689348814741910528]
  let r1 = SUM(x)
  let r2 = SUM(x + x) -- should overflow
  return r1, r2
)

--
ERROR: generic::out_of_range: int64 overflow

==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,SAFE_FUNCTION_CALL]
[name=horizontal_aggregation_safe_agg]

# SAFE aggregates are supported
SELECT * from graph_table(aml
  let x = [3689348814741910528,3689348814741910528]
  let r1 = safe.sum(x)
  let r2 = safe.sum(x + x)  # should overflow
  return r1, r2
)

--
ARRAY<STRUCT<r1 INT64, r2 INT64>>[{7378697629483821056, NULL}]

==

[name=horizontal_aggregation_conditional_evaluation]

# Horizontal aggregation with possibly failing aggregates
SELECT * from graph_table(aml
  let x = [4, 0, 5]
  let r1 = IFERROR(SUM(x / 0), SUM(x))
  let r2 = IF(LOGICAL_OR(x = 0), SUM(x / 2), SUM(2 / x))
  let r3 = IFERROR(SUM(x / 2) + SUM(2 / x), SUM(x / 2))
  let r4 = COALESCE(SUM(x / 2), SUM(2 / x))
  let r5 = CASE WHEN SUM(x) = 9 THEN COUNT(x * 0) ELSE SUM(x / 0) END

  return r1, r2, r3, r4, r5
)

--
ARRAY<STRUCT<r1 DOUBLE, r2 DOUBLE, r3 DOUBLE, r4 DOUBLE, r5 DOUBLE>>[
  {9, 4.5, 4.5, 4.5, 3}
]

==

[name=horizontal_aggregation_null_array]
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,ORDER_BY_IN_AGGREGATE]

# Horizontal aggregation with possibly failing aggregates
SELECT * from graph_table(aml
  let xs = CAST(NULL AS ARRAY<INT64>)
  let bs = CAST(NULL AS ARRAY<BOOL>)
  let r1 = SUM(xs)
  LET r2 = COUNT(bs)
  LET r3 = COUNTIF(bs)
  LET r4 = ARRAY_AGG(xs)
  return r1, r2, r3, r4
)

--
ARRAY<STRUCT<r1 INT64, r2 INT64, r3 INT64, r4 ARRAY<>>>[
  {NULL, 0, 0, ARRAY<INT64>(NULL)}
]
==

[name=horizontal_aggregation_array_agg_options_without_limit]
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,HAVING_IN_AGGREGATE,NULL_HANDLING_MODIFIER_IN_AGGREGATE,ORDER_BY_IN_AGGREGATE]
# All features of ARRAY_AGG
select * from graph_table(aml
  let single = 3
  let x = [1, 2, 3, 4, 5]
  let r1 = ARRAY_AGG(x + single IGNORE NULLS HAVING MAX -x ORDER BY x - single)
  # This having min doesn't actually do anything
  let r2 = ARRAY_AGG(DISTINCT x + single IGNORE NULLS HAVING MIN 3 ORDER BY x + single )
  let r3 = ARRAY_AGG(if (x = 4, NULL, x) IGNORE NULLS HAVING MIN 3 ORDER BY -x)
  return r1, r2, r3
)
--
ARRAY<STRUCT<r1 ARRAY<>, r2 ARRAY<>, r3 ARRAY<>>>[
  {
    ARRAY<INT64>[4],
    ARRAY<INT64>[known order:4, 5, 6, 7, 8],
    ARRAY<INT64>[known order:5, 3, 2, 1]
  }
]

==
[name=horizontal_aggregation_array_agg_options]
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,LIMIT_IN_AGGREGATE,HAVING_IN_AGGREGATE,NULL_HANDLING_MODIFIER_IN_AGGREGATE,ORDER_BY_IN_AGGREGATE]
# All features of ARRAY_AGG
select * from graph_table(aml
  let single = 3
  let x = [1, 2, 3, 4, 5]
  let r1 = ARRAY_AGG(x + single IGNORE NULLS HAVING MAX -x ORDER BY x - single LIMIT 1 )
  # This having min doesn't actually do anything
  let r2 = ARRAY_AGG(DISTINCT x + single IGNORE NULLS HAVING MIN 3 ORDER BY x + single LIMIT 1  )
  let r3 = ARRAY_AGG(if (x = 4, NULL, x) IGNORE NULLS HAVING MIN 3 ORDER BY -x LIMIT 1  )
  return r1, r2, r3
)
--
ARRAY<STRUCT<r1 ARRAY<>, r2 ARRAY<>, r3 ARRAY<>>>[
  {ARRAY<INT64>[4], ARRAY<INT64>[4], ARRAY<INT64>[5]}
]
==
[name=horizontal_aggregation_having_max_and_order_by_same_variable]
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,HAVING_IN_AGGREGATE,ORDER_BY_IN_AGGREGATE]
# b/347756011
select * from graph_table(aml
  let x = [1,2,3]
  let y = 3
  let z = ARRAY_AGG(x having min y order by y)
  let r1 = SUM(z)  # r1 isn't actually ordered
  return r1
)
--
ARRAY<STRUCT<r1 INT64>>[{6}]
==
[name=horizontal_aggregation_version_of_b789907559]
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,ORDER_BY_IN_AGGREGATE]
select * from graph_table(aml
  let x = [1,2,3]
  let z = ARRAY_AGG(distinct x+1 order by x+1)
  let z2 = ARRAY_AGG(distinct x+1 order by x+1)
  return z, z2
)
--
ARRAY<STRUCT<z ARRAY<>, z2 ARRAY<>>>[
  {
    ARRAY<INT64>[known order:2, 3, 4],
    ARRAY<INT64>[known order:2, 3, 4]
  }
]
==
[default required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,SQL_GRAPH_BOUNDED_PATH_QUANTIFICATION]
[name=quantified_path_with_zero_lower_bound_test_1]
select * from graph_table(aml
  MATCH (x:Account {account_id: 1030})((a)-[e:Transfer]->(b)){0,1}(y:Account)
  return x.account_id AS x_id, ARRAY_LENGTH(e) AS e_len, y.account_id AS y_id
)
order by x_id, e_len, y_id
--

ARRAY<STRUCT<x_id INT64, e_len INT64, y_id INT64>>[known order:
  {1030, 0, 1030},
  {1030, 1, 1010}
]
==
[name=quantified_path_with_zero_lower_bound_test_2]
select * from graph_table(aml
  MATCH (x)-[:Transfer]->((a)-[e:Transfer]->(b)){0,1}-[:Transfer]->(y:Account {account_id: 1030})
  return x.account_id AS x_id, ARRAY_LENGTH(e) AS e_len, y.account_id AS y_id
)
order by x_id, e_len, y_id
--
ARRAY<STRUCT<x_id INT64, e_len INT64, y_id INT64>>[known order:
  {1010, 0, 1030},
  {1010, 0, 1030},
  {1010, 0, 1030},
  {1010, 0, 1030},
  {1010, 1, 1030},
  {1010, 1, 1030},
  {1010, 1, 1030},
  {1010, 1, 1030},
  {1030, 1, 1030},
  {1030, 1, 1030},
  {1030, 1, 1030},
  {1030, 1, 1030}
]
==
[name=quantified_path_with_zero_lower_bound_test_3]
select * from graph_table(aml
  MATCH ((a)-[e:Transfer]->(b)){0,1}-[:Transfer]->(y:Account {account_id: 1030})
  return ARRAY_LENGTH(e) AS e_len, y.account_id AS y_id
)
order by e_len, y_id
--
ARRAY<STRUCT<e_len INT64, y_id INT64>>[known order:
  {0, 1030},
  {0, 1030},
  {1, 1030},
  {1, 1030},
  {1, 1030},
  {1, 1030}
]
==
[name=quantified_path_with_zero_lower_bound_test_4]
select * from graph_table(aml
  MATCH ((a:Human)-[e:Login]->(b:Account)){0,1}-[:Transfer]->(y:Account {account_id: 1030})
  return ARRAY_LENGTH(e) AS e_len, y.account_id AS y_id
)
order by e_len, y_id
--
ARRAY<STRUCT<e_len INT64, y_id INT64>>[known order:{0, 1030}, {0, 1030}]
==
[name=quantified_path_with_zero_lower_bound_test_5]
select * from graph_table(aml
  MATCH ((a:Human)-[e1:Login]->(b:Account)){0,1}-[e2:Transfer]->{0, 1}(y:Account {account_id: 1030})
  return ARRAY_LENGTH(e1) AS e1_len, ARRAY_LENGTH(e2) AS e2_len, y.account_id AS y_id
)
order by e1_len, e2_len, y_id
--
ARRAY<STRUCT<e1_len INT64, e2_len INT64, y_id INT64>>[known order:
  {0, 0, 1030},
  {0, 1, 1030},
  {0, 1, 1030},
  {1, 0, 1030}
]
==
[name=quantified_path_with_zero_lower_bound_test_6]
select * from graph_table(aml
  MATCH ANY SHORTEST ((a:Human)-[e1:Login]->(b:Account)){0,1}-[e2:Transfer]->{0, 1}(y:Account {account_id: 1030})
  return ARRAY_LENGTH(e1) AS e1_len, ARRAY_LENGTH(e2) AS e2_len, y.account_id AS y_id
)
order by e1_len, e2_len, y_id
--
ARRAY<STRUCT<e1_len INT64, e2_len INT64, y_id INT64>>[known order:
  {0, 0, 1030},
  {0, 1, 1030},
  {1, 0, 1030}
]

NOTE: Reference implementation reports non-determinism.
==
[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,SQL_GRAPH_BOUNDED_PATH_QUANTIFICATION,SQL_GRAPH_CHEAPEST_PATH]
[name=quantified_path_with_zero_lower_bound_test_7]
select * from graph_table(aml
  MATCH ANY CHEAPEST ((a:Human)-[e1:Login COST 1]->(b:Account)){0,1}-[e2:Transfer COST e2.amount]->{0, 1}(y:Account {account_id: 1030})
  return ARRAY_LENGTH(e1) AS e1_len, ARRAY_LENGTH(e2) AS e2_len, y.account_id AS y_id
)
order by e1_len, e2_len, y_id
--
ARRAY<STRUCT<e1_len INT64, e2_len INT64, y_id INT64>>[known order:
  {0, 0, 1030},
  {0, 1, 1030},
  {1, 0, 1030}
]
==
[name=fixed_quantified_test]
select * from graph_table(aml
  MATCH (x:Account)((a)-[e:Transfer]->(b)){3}(y:Account)
  return x.account_id AS x_id, y.account_id AS y_id
)
order by x_id, y_id
--
ARRAY<STRUCT<x_id INT64, y_id INT64>>[known order:
  {1010, 1010},
  {1010, 1010},
  {1010, 1010},
  {1010, 1010},
  {1010, 1010},
  {1010, 1020},
  {1010, 1020},
  {1010, 1030},
  {1010, 1030},
  {1010, 1030},
  {1010, 1030},
  {1020, 1010},
  {1020, 1010},
  {1020, 1020},
  {1020, 1020},
  {1020, 1020},
  {1020, 1020},
  {1030, 1010},
  {1030, 1020},
  {1030, 1020},
  {1030, 1030},
  {1030, 1030},
  {1030, 1030},
  {1030, 1030}
]
==

[name=lower_upper_quantified_test]
select * from graph_table(aml
  MATCH (x:Account)((a)-[e:Transfer]->(b)){1,2}(y:Account)
  return x.account_id AS x_id, y.account_id AS y_id
)
order by x_id, y_id
--
ARRAY<STRUCT<x_id INT64, y_id INT64>>[known order:
  {1010, 1010},
  {1010, 1010},
  {1010, 1020},
  {1010, 1020},
  {1010, 1020},
  {1010, 1020},
  {1010, 1030},
  {1010, 1030},
  {1010, 1030},
  {1010, 1030},
  {1020, 1010},
  {1020, 1010},
  {1020, 1030},
  {1020, 1030},
  {1030, 1010},
  {1030, 1010},
  {1030, 1020},
  {1030, 1020}
]
==

[name=count_possible_paths]
select * from graph_table(aml
  MATCH (x:Account)((a)-[e:Transfer]->(b)){1,2}(y:Account)
  RETURN x.account_id AS x_id, y.account_id AS y_id, COUNT(*) AS num_possible_paths GROUP BY x_id, y_id
)
order by x_id, y_id
--
ARRAY<STRUCT<
        x_id INT64,
        y_id INT64,
        num_possible_paths INT64
      >>
[known order:{1010, 1010, 2},
             {1010, 1020, 4},
             {1010, 1030, 4},
             {1020, 1010, 2},
             {1020, 1030, 2},
             {1030, 1010, 2},
             {1030, 1020, 2}]
==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,SQL_GRAPH_BOUNDED_PATH_QUANTIFICATION,GROUP_BY_ARRAY]
[name=count_possible_paths_group_by_group_var]
# using group var as a grouping key
select * from graph_table(aml
  MATCH (x:Account)((a)-[e:Transfer]->(b)){1,2}(y:Account)
  RETURN x.account_id AS x_id, y.account_id AS y_id, COUNT(*) AS num_possible_paths GROUP BY x_id, y_id, e
)
order by x_id, y_id
--
ARRAY<STRUCT<
        x_id INT64,
        y_id INT64,
        num_possible_paths INT64
      >>
[known order:{1010, 1010, 1},
             {1010, 1010, 1},
             {1010, 1020, 1},
             {1010, 1020, 1},
             {1010, 1020, 1},
             {1010, 1020, 1},
             {1010, 1030, 1},
             {1010, 1030, 1},
             {1010, 1030, 1},
             {1010, 1030, 1},
             {1020, 1010, 1},
             {1020, 1010, 1},
             {1020, 1030, 1},
             {1020, 1030, 1},
             {1030, 1010, 1},
             {1030, 1010, 1},
             {1030, 1020, 1},
             {1030, 1020, 1}]
==

# Avoid immediate cycles within 1-hop. Once we have group variable support, we
# may be able to add a filter to prune out all possible cycles.
[name=quantified_path_avoid_immediate_cycles]
select * from graph_table(aml
  MATCH (x:Account)((a)-[e:Transfer]->(b) WHERE ALL_DIFFERENT(a, b)){1,2}(y:Account)
  RETURN x.account_id AS x_id, y.account_id AS y_id
)
order by x_id, y_id
--
ARRAY<STRUCT<x_id INT64, y_id INT64>>[known order:
  {1010, 1020},
  {1010, 1020},
  {1010, 1030},
  {1010, 1030},
  {1010, 1030},
  {1010, 1030},
  {1020, 1010},
  {1020, 1010},
  {1020, 1030},
  {1020, 1030},
  {1030, 1010},
  {1030, 1020},
  {1030, 1020}
]

==
[name=multihop_within_quantified_path_test]
# Test with more than 1 edge within a quantified path
select * from graph_table(aml
  MATCH (x:Account)((a)-[e:Transfer]->(b)-[f:Transfer]->(c)){1}(y:Account)
  return x.account_id AS x_id, y.account_id AS y_id
)
order by x_id, y_id
--
ARRAY<STRUCT<x_id INT64, y_id INT64>>[known order:
  {1010, 1010},
  {1010, 1020},
  {1010, 1020},
  {1010, 1030},
  {1010, 1030},
  {1010, 1030},
  {1010, 1030},
  {1020, 1010},
  {1020, 1010},
  {1030, 1010},
  {1030, 1020},
  {1030, 1020}
]
==

[name=concatenated_quantifiers_test]
# Test the concatenation of 2 quantified paths
select * from graph_table(aml
  MATCH (x:Account)((a)-[e:Transfer]->(b)){1} ((g)-[f:Transfer]->(h)){2}(y:Account)
  return x.account_id AS x_id, y.account_id AS y_id
)
order by x_id, y_id
--
ARRAY<STRUCT<x_id INT64, y_id INT64>>[known order:
  {1010, 1010},
  {1010, 1010},
  {1010, 1010},
  {1010, 1010},
  {1010, 1010},
  {1010, 1020},
  {1010, 1020},
  {1010, 1030},
  {1010, 1030},
  {1010, 1030},
  {1010, 1030},
  {1020, 1010},
  {1020, 1010},
  {1020, 1020},
  {1020, 1020},
  {1020, 1020},
  {1020, 1020},
  {1030, 1010},
  {1030, 1020},
  {1030, 1020},
  {1030, 1030},
  {1030, 1030},
  {1030, 1030},
  {1030, 1030}
]
==

[name=traverse_from_quantified_test]
# Test that extending a quantified path with more path factors works correctly
select * from graph_table(aml
  MATCH (x:Account)((a)-[e:Transfer]->(b)){1,2}-[f:Transfer WHERE f.amount > 500]->(y:Account)
  return x.account_id AS x_id, y.account_id AS y_id
)
order by x_id, y_id
--
ARRAY<STRUCT<x_id INT64, y_id INT64>>[known order:
  {1010, 1010},
  {1010, 1010},
  {1020, 1010},
  {1020, 1010},
  {1030, 1010},
  {1030, 1010}
]

==

[name=traverse_to_quantified_test]
# Test that traversing to a quantified path from other path factors works
# correctly
select * from graph_table(aml
  MATCH (p:Human)-[l:Login]->((a)-[e:Transfer]->(b)){1,2}(y:Account)
  return p.name AS person_name, y.account_id AS y_id
)
order by person_name, y_id
--
ARRAY<STRUCT<person_name STRING, y_id INT64>>[known order:
  {"name1", 1010},
  {"name1", 1010},
  {"name1", 1020},
  {"name1", 1020},
  {"name1", 1020},
  {"name1", 1020},
  {"name1", 1030},
  {"name1", 1030},
  {"name1", 1030},
  {"name1", 1030},
  {"name2", 1010},
  {"name2", 1010},
  {"name2", 1020},
  {"name2", 1020}
]
==

[name=quantifier_with_start_node_filter]
# This tests that the start node and every intermediate position of 'a' have
# the same 'account_id'
select * from graph_table(aml
  MATCH (x:Account)((a WHERE a.account_id = 1010)-[e:Transfer]->(b)){1,2}(y:Account)
  return x.account_id AS x_id, y.account_id AS y_id
)
order by x_id, y_id
--
ARRAY<STRUCT<x_id INT64, y_id INT64>>[known order:
  {1010, 1010},
  {1010, 1010},
  {1010, 1020},
  {1010, 1020},
  {1010, 1020},
  {1010, 1020}
]
==

[name=external_filtered_alias]
# In contrast to the previous test, this tests that ONLY the start node has a
# fixed 'account_id'.
select * from graph_table(aml
  MATCH (p:Human)-[l:Login]->(x:Account {account_id: 1010})((a)-[e:Transfer]->(b)){1,2}(y:Account)
  return p.name AS person_name, y.account_id AS y_id
)
order by person_name, y_id
--
ARRAY<STRUCT<person_name STRING, y_id INT64>>[known order:
  {"name1", 1010},
  {"name1", 1010},
  {"name1", 1020},
  {"name1", 1020},
  {"name1", 1020},
  {"name1", 1020},
  {"name1", 1030},
  {"name1", 1030},
  {"name1", 1030},
  {"name1", 1030}
]
==

[name=quantifier_with_end_node_filter]
select * from graph_table(aml
  MATCH (x:Account)((a)-[e:Transfer]->(b WHERE b.account_id = 1010)){1,2}(y:Account)
  return x.account_id AS x_id, y.account_id AS y_id
)
order by x_id, y_id
--
ARRAY<STRUCT<x_id INT64, y_id INT64>>[known order:
  {1010, 1010},
  {1010, 1010},
  {1030, 1010},
  {1030, 1010}
]
==

[name=quantifier_with_edge_filter]
select * from graph_table(aml
  MATCH (x:Account)((a)-[e:Transfer WHERE e.amount > 200]->(b)){1,2}(y:Account)
  return x.account_id AS x_id, y.account_id AS y_id
)
order by x_id, y_id
--
ARRAY<STRUCT<x_id INT64, y_id INT64>>[known order:
  {1010, 1010},
  {1010, 1010},
  {1020, 1010},
  {1020, 1010},
  {1020, 1030},
  {1020, 1030},
  {1030, 1010},
  {1030, 1010}
]

==

[required_features=SQL_GRAPH,SQL_GRAPH_ADVANCED_QUERY,SQL_GRAPH_BOUNDED_PATH_QUANTIFICATION,ORDER_BY_IN_AGGREGATE]
[name=group_variables_basic]
select head, amounts, tail from graph_table(aml
  match (head:Account)(-[e:Transfer]->{1,2})(tail:Account)
  let amounts = ARRAY_AGG(e.amount)
  let sort_by = STRING_AGG(CAST(e.amount AS STRING), "x") # can't order by array
  return head.account_id as head, amounts, sort_by, tail.account_id as tail
)
order by ARRAY_LENGTH(amounts), sort_by, head, tail
--
ARRAY<STRUCT<head INT64, amounts ARRAY<>, tail INT64>>[known order:
  {1010, ARRAY<INT64>[100], 1020},
  {1010, ARRAY<INT64>[200], 1020},
  {1020, ARRAY<INT64>[300], 1030},
  {1020, ARRAY<INT64>[400], 1030},
  {1030, ARRAY<INT64>[500], 1010},
  {1010, ARRAY<INT64>[600], 1010},
  {
    1010,
    ARRAY<INT64>[known order:100, 300],
    1030
  },
  {
    1010,
    ARRAY<INT64>[known order:100, 400],
    1030
  },
  {
    1010,
    ARRAY<INT64>[known order:200, 300],
    1030
  },
  {
    1010,
    ARRAY<INT64>[known order:200, 400],
    1030
  },
  {
    1020,
    ARRAY<INT64>[known order:300, 500],
    1010
  },
  {
    1020,
    ARRAY<INT64>[known order:400, 500],
    1010
  },
  {
    1030,
    ARRAY<INT64>[known order:500, 100],
    1020
  },
  {
    1030,
    ARRAY<INT64>[known order:500, 200],
    1020
  },
  {
    1030,
    ARRAY<INT64>[known order:500, 600],
    1010
  },
  {
    1010,
    ARRAY<INT64>[known order:600, 100],
    1020
  },
  {
    1010,
    ARRAY<INT64>[known order:600, 200],
    1020
  },
  {
    1010,
    ARRAY<INT64>[known order:600, 600],
    1010
  }
]

